<?php

use Illuminate\Database\Seeder;
use \App\Workbook;

class DummyWorkbooksSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        //delete all data.
        //DB::statement('SET CONSTRAINTS ALL DEFERRED;');
//        Workbook::truncate();
        //DB::statement('SET CONSTRAINTS ALL IMMEDIATE;');
        DB::statement('ALTER TABLE workbooks AUTO_INCREMENT = 1;');
        $faker = Faker\Factory::create("ja_JP");

        $units = \App\Unit::all();
        foreach ($units as $unit) {
            $wbTitles = $this->get($unit->curriculum->subject->id, $unit->number);
            $i = 0;
            foreach($wbTitles as $title){
                $workbook = Workbook::create([
                    "number" => $i,
                    "title" => $title,
                    "unit_id" => $unit->id,
                ]);
                $workbook->save();
                $i++;

//                $wbId = $workbook->id;
//                switch($i){
//                    case 0:
//                        \App\Challenge::create([
//                            "workbook_id" => $wbId,
//                        ])->save();
//                        break;
//                    default:
//                        \App\Supplement::create([
//                            "workbook_id" => $wbId,
//                        ])->save();
//                }
            }
        }
    }

    private function get($subjectId, $unitNumber){
        $d =
            [
                [
                    [
                        "チャレンジ",
                        "１年生の漢字(A)",
                        "１年生の漢字(B)",
                        "ひらがな・カタカナ(A)",
                        "ひらがな・カタカナ(B)",
                        "１年生の漢字(C)",
                        "１年生の漢字(D)",
                        "ひらがな・カタカナ(C)",
                        "ひらがな・カタカナ(D)",
                        "ひらがな・カタカナ(E)",
                        "１年生の漢字(E)",
                        "１年生の漢字(F)",
                        "ひらがな・カタカナ(E)",
                        "ひらがな・カタカナ(F)",
                        "ひらがな・カタカナ(G)",
                    ],[
                        "チャレンジ",
                        "１，２年生の漢字(A)",
                        "１，２年生の漢字(B)",
                        "基本のかなづかい(A)",
                        "基本のかなづかい(B)",
                        "１，２年生の漢字(C)",
                        "１，２年生の漢字(D)",
                        "基本のかなづかい(C)",
                        "基本のかなづかい(D)",
                        "基本のかなづかい(E)",
                        "１，２年生の漢字(E)",
                        "１，２年生の漢字(F)",
                        "基本のかなづかい(E)",
                        "基本のかなづかい(F)",
                        "基本のかなづかい(G)",
                    ],[
                        "チャレンジ",
                        "２年生の漢字(A)",
                        "２年生の漢字(B)",
                        "主語・述語・修飾語・指示語・段落など(A)",
                        "主語・述語・修飾語・指示語・段落など(B)",
                        "２年生の漢字(C)",
                        "２年生の漢字(D)",
                        "主語・述語・修飾語・指示語・段落など(C)",
                        "主語・述語・修飾語・指示語・段落など(D)",
                        "主語・述語・修飾語・指示語・段落など(E)",
                        "２年生の漢字(E)",
                        "２年生の漢字(F)",
                        "主語・述語・修飾語・指示語・段落など(E)",
                        "主語・述語・修飾語・指示語・段落など(F)",
                        "主語・述語・修飾語・指示語・段落など(G)",
                    ],[
                        "チャレンジ",
                        "２，３年生の漢字(A)",
                        "２，３年生の漢字(B)",
                        "漢和辞典の使い方",
                        "部首",
                        "２，３年生の漢字(C)",
                        "２，３年生の漢字(D)",
                        "漢和辞典の使い方(C)",
                        "部首(C)",
                        "部首(D)",
                        "２，３年生の漢字(E)",
                        "２，３年生の漢字(F)",
                        "漢和辞典の使い方(E)",
                        "部首(F)",
                        "部首(G)",
                    ],[
                        "チャレンジ",
                        "３年生の漢字(A)",
                        "３年生の漢字(B)",
                        "ローマ字(A)",
                        "ローマ字(B)",
                        "３年生の漢字(C)",
                        "３年生の漢字(D)",
                        "ローマ字(C)",
                        "ローマ字(D)",
                        "ローマ字(E)",
                        "３年生の漢字(E)",
                        "３年生の漢字(F)",
                        "ローマ字(E)",
                        "ローマ字(F)",
                        "ローマ字(G)",
                    ],[
                        "チャレンジ",
                        "３，４年生の漢字(A)",
                        "３，４年生の漢字(B)",
                        "「引用」について(A)",
                        "「引用」について(B)",
                        "３，４年生の漢字(C)",
                        "３，４年生の漢字(D)",
                        "「引用」について(C)",
                        "「引用」について(D)",
                        "「引用」について(E)",
                        "３，４年生の漢字(E)",
                        "３，４年生の漢字(F)",
                        "「引用」について(E)",
                        "「引用」について(F)",
                        "「引用」について(G)",
                    ],[
                        "チャレンジ",
                        "４年生の漢字(A)",
                        "４年生の漢字(B)",
                        "「敬語」について(A)",
                        "「敬語」について(B)",
                        "４年生の漢字(C)",
                        "４年生の漢字(D)",
                        "「敬語」について(C)",
                        "「敬語」について(D)",
                        "「敬語」について(E)",
                        "４年生の漢字(E)",
                        "４年生の漢字(F)",
                        "「敬語」について(E)",
                        "「敬語」について(F)",
                        "「敬語」について(G)",
                    ],[
                        "チャレンジ",
                        "４，５年生の漢字(A)",
                        "４，５年生の漢字(B)",
                        "様子や気持ちなどを表すことば(A)",
                        "様子や気持ちなどを表すことば(B)",
                        "４，５年生の漢字(C)",
                        "４，５年生の漢字(D)",
                        "様子や気持ちなどを表すことば(C)",
                        "様子や気持ちなどを表すことば(D)",
                        "様子や気持ちなどを表すことば(E)",
                        "４，５年生の漢字(E)",
                        "４，５年生の漢字(F)",
                        "様子や気持ちなどを表すことば(E)",
                        "様子や気持ちなどを表すことば(F)",
                        "様子や気持ちなどを表すことば(G)",
                    ],[
                        "チャレンジ",
                        "５年生の漢字(A)",
                        "５年生の漢字(B)",
                        "故事成語・ことわざ・慣用句(A)",
                        "故事成語・ことわざ・慣用句(B)",
                        "５年生の漢字(C)",
                        "５年生の漢字(D)",
                        "故事成語・ことわざ・慣用句(C)",
                        "故事成語・ことわざ・慣用句(D)",
                        "故事成語・ことわざ・慣用句(E)",
                        "５年生の漢字(E)",
                        "５年生の漢字(F)",
                        "故事成語・ことわざ・慣用句(E)",
                        "故事成語・ことわざ・慣用句(F)",
                        "故事成語・ことわざ・慣用句(G)",
                    ],[
                        "チャレンジ",
                        "５年生の漢字(A)",
                        "５年生の漢字(B)",
                        "表現の工夫(A)",
                        "表現の工夫(B)",
                        "５年生の漢字(C)",
                        "５年生の漢字(D)",
                        "表現の工夫(C)",
                        "表現の工夫(D)",
                        "表現の工夫(E)",
                        "５年生の漢字(E)",
                        "５年生の漢字(F)",
                        "表現の工夫(E)",
                        "表現の工夫(F)",
                        "表現の工夫(G)",
                    ]
                ],
                [
                    [
                        "チャレンジ",
                        "分数のたし算・ひき算",
                        "小数のかけ算・わり算",
                        "整数の除法",
                        "平行四辺形，ひし形，台形",
                        "ともなって変わる2つの数量",
                        "分数のたし算・ひき算(C)",
                        "小数のかけ算・わり算(D)",
                        "整数の除法(C)",
                        "平行四辺形，ひし形，台形(C)",
                        "ともなって変わる2つの数量(D)",
                        "分数のたし算・ひき算(E)",
                        "小数のかけ算・わり算(F)",
                        "整数の除法(E)",
                        "平行四辺形，ひし形，台形(F)",
                        "ともなって変わる2つの数量(G)",
                    ],[
                        "チャレンジ",
                        "偶数・奇数",
                        "約数",
                        "倍数",
                        "偶数・奇数(C)",
                        "約数(C)",
                        "倍数(C)",
                        "約数(D)",
                        "倍数(D)",
                        "偶数・奇数(E)",
                        "約数(E)",
                        "倍数(E)",
                        "約数(E)",
                        "倍数(E)",
                    ],[
                        "チャレンジ",
                        "整数×小数の計算",
                        "小数×小数の計算",
                        "計算のきまり",
                        "小数のかけ算を使って",
                        "整数×小数の計算(C)",
                        "小数×小数の計算(C)",
                        "計算のきまり(C)",
                        "小数のかけ算を使って(C)",
                        "小数のかけ算を使って(D)",
                        "整数×小数の計算(E)",
                        "小数×小数の計算(E)",
                        "計算のきまり(E)",
                        "小数のかけ算を使って(E)",
                        "小数のかけ算を使って(F)",
                    ],[
                        "チャレンジ",
                        "整数÷小数の計算",
                        "小数÷小数の計算",
                        "あまりのあるわり算",
                        "どんな式になるかな",
                        "整数÷小数の計算(C)",
                        "小数÷小数の計算(C)",
                        "あまりのあるわり算(C)",
                        "どんな式になるかな(C)",
                        "どんな式になるかな(D)",
                        "整数÷小数の計算(E)",
                        "小数÷小数の計算(E)",
                        "あまりのあるわり算(E)",
                        "どんな式になるかな(E)",
                        "どんな式になるかな(F)",
                    ],[
                        "チャレンジ",
                        "大きさの等しい分数",
                        "通分",
                        "分数のたし算",
                        "分数のひき算",
                        "分数と時間から",
                        "大きさの等しい分数(C)",
                        "通分(C)",
                        "分数のたし算(C)",
                        "分数のひき算(C)",
                        "分数と時間から(C)",
                        "大きさの等しい分数(E)",
                        "通分(E)",
                        "分数のたし算(E)",
                        "分数のひき算(E)",
                        "分数と時間から(E)",
                    ],[
                        "チャレンジ",
                        "平行四辺形の面積の求め方",
                        "三角形の面積の求め方",
                        "ひし形の面積の求め方",
                        "台形の面積の求め方",
                        "三角形の高さと面積の関係",
                        "平行四辺形の面積の求め方(C)",
                        "三角形の面積の求め方(C)",
                        "ひし形の面積の求め方(C)",
                        "台形の面積の求め方(C)",
                        "三角形の高さと面積の関係(C)",
                        "平行四辺形の面積の求め方(D)",
                        "三角形の面積の求め方(D)",
                        "ひし形の面積の求め方(D)",
                        "台形の面積の求め方(D)",
                        "三角形の高さと面積の関係(D)",
                    ],[
                        "チャレンジ",
                        "体積の単位",
                        "立方体・直方体の体積",
                        "いろいろな形の体積",
                        "容積",
                        "体積の単位(C)",
                        "立方体・直方体の体積(C)",
                        "いろいろな形の体積(C)",
                        "容積(C)",
                        "容積(D)",
                        "体積の単位(E)",
                        "立方体・直方体の体積(E)",
                        "いろいろな形の体積(E)",
                        "容積(E)",
                        "容積(E)",
                    ],[
                        "チャレンジ",
                        "平均",
                        "単位量あたりの大きさ",
                        "平均(C)",
                        "単位量あたりの大きさ(C)",
                        "平均(C)",
                        "単位量あたりの大きさ(C)",
                        "平均(D)",
                        "平均(E)",
                        "単位量あたりの大きさ(E)",
                        "平均(E)",
                        "単位量あたりの大きさ(E)",
                        "平均(E)",
                    ],[
                        "チャレンジ",
                        "三角形の角の大きさの和",
                        "四角形の角の大きさの和",
                        "多角形の角の大きさの和",
                        "円周率",
                        "三角形の角の大きさの和(C)",
                        "四角形の角の大きさの和(C)",
                        "多角形の角の大きさの和(C)",
                        "円周率(C)",
                        "円周率(D)",
                        "三角形の角の大きさの和(D)",
                        "四角形の角の大きさの和(D)",
                        "多角形の角の大きさの和(D)",
                        "円周率(D)",
                        "円周率(E)",
                    ],[
                        "チャレンジ",
                        "割合",
                        "百分率と歩合",
                        "割合を使う問題",
                        "割合を表すグラフ",
                        "割合(C)",
                        "百分率と歩合(C)",
                        "割合を使う問題(C)",
                        "割合を表すグラフ(C)",
                        "割合を表すグラフ(D)",
                        "割合(D)",
                        "百分率と歩合(D)",
                        "割合を使う問題(D)",
                        "割合を表すグラフ(D)",
                        "割合を表すグラフ(E)",
                    ],
                ]
            ];
        return $d[$subjectId - 1][$unitNumber - 1];
    }
}
